# BoundaryParamPresetLinear Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryParamPresetLinear Property
ParameterTypeId Class See Also
---
"State"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryParamPresetLinear { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryParamPresetLinear As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryParamPresetLinear {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace